org/Information_Theory_for_Fields_by_Torsten_Enslin_in_2019.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Information_Theory_for_Fields_by_Torsten_Enslin_in_2019
#+TITLE: Information Theory for Fields by Torsten Enslin in 2019
* 1. Information field theory
** 1.1 Aim
** 1.2 Structure of the work
*** In this Sect. 1, the problem of field inference is approached with Bayesian probability theory.
*** In Sect. 2, the free theory of IFT is developed using an illustrative example of a diffusion process driven by white noise and observed at some point in time.
*** In Sect. 3, this is then extended into the non-linear regime, leading to interacting IFT in wich the field estimate is not a linear function of the data any more.
*** Sect. 4 IFT algorithms and their numerical implementation.
*** Sect. 5 future developments in IFT
** 1.3 Physical fields
** 1.4 Smoothness and correlations
** 1.5 Bayes and statistical physics
** 1.6 Expectation values
** 1.7 Maximum entropy
** 1.8 Infinities
* 2. Free fields
** 2.1 Simplistic scenario
** 2.2 Prior regularization
** 2.3 Wiener filter
** 2.4 Generalized Wiener filter
** 2.5 Information propagation
** 2.6 Maximum likelihood
** 2.7 Optimal estimate
** 2.8 Critical filter
* 3. Interacting fields
** 3.1 Classical field approximation
** 3.2 Comparison to other estimators
*** 3.2.1 Maximum likelihood
*** 3.2.2 Hamiltonian Monte Carlo for fields
** 3.3 Mean field approximation
** 3.4 Operator formalism
** 3.5 Kullbach-Leibler sampling
* 4. Applications
** 4.1 Numerical information field theory
** 4.2 Photon imaging
** 4.3 Available IFT algorithms
** 4.4 Non-Gaussianity
** 4.5 Information field dynamics
* 5. Outlook
