content/posts/Information_Theory_for_Fields_by_Torsten_Enslin_in_2019.md
+++
title = "Information Theory for Fields by Torsten Enslin in 2019"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:46-04:00
slug = "Information_Theory_for_Fields_by_Torsten_Enslin_in_2019"
draft = false
+++

## 1. Information field theory {#1-dot-information-field-theory}


### 1.1 Aim {#1-dot-1-aim}


### 1.2 Structure of the work {#1-dot-2-structure-of-the-work}

<!--list-separator-->

-  In this Sect. 1, the problem of field inference is approached with Bayesian probability theory.

<!--list-separator-->

-  In Sect. 2, the free theory of IFT is developed using an illustrative example of a diffusion process driven by white noise and observed at some point in time.

<!--list-separator-->

-  In Sect. 3, this is then extended into the non-linear regime, leading to interacting IFT in wich the field estimate is not a linear function of the data any more.

<!--list-separator-->

-  Sect. 4 IFT algorithms and their numerical implementation.

<!--list-separator-->

-  Sect. 5 future developments in IFT


### 1.3 Physical fields {#1-dot-3-physical-fields}


### 1.4 Smoothness and correlations {#1-dot-4-smoothness-and-correlations}


### 1.5 Bayes and statistical physics {#1-dot-5-bayes-and-statistical-physics}


### 1.6 Expectation values {#1-dot-6-expectation-values}


### 1.7 Maximum entropy {#1-dot-7-maximum-entropy}


### 1.8 Infinities {#1-dot-8-infinities}


## 2. Free fields {#2-dot-free-fields}


### 2.1 Simplistic scenario {#2-dot-1-simplistic-scenario}


### 2.2 Prior regularization {#2-dot-2-prior-regularization}


### 2.3 Wiener filter {#2-dot-3-wiener-filter}


### 2.4 Generalized Wiener filter {#2-dot-4-generalized-wiener-filter}


### 2.5 Information propagation {#2-dot-5-information-propagation}


### 2.6 Maximum likelihood {#2-dot-6-maximum-likelihood}


### 2.7 Optimal estimate {#2-dot-7-optimal-estimate}


### 2.8 Critical filter {#2-dot-8-critical-filter}


## 3. Interacting fields {#3-dot-interacting-fields}


### 3.1 Classical field approximation {#3-dot-1-classical-field-approximation}


### 3.2 Comparison to other estimators {#3-dot-2-comparison-to-other-estimators}

<!--list-separator-->

-  3.2.1 Maximum likelihood

<!--list-separator-->

-  3.2.2 Hamiltonian Monte Carlo for fields


### 3.3 Mean field approximation {#3-dot-3-mean-field-approximation}


### 3.4 Operator formalism {#3-dot-4-operator-formalism}


### 3.5 Kullbach-Leibler sampling {#3-dot-5-kullbach-leibler-sampling}


## 4. Applications {#4-dot-applications}


### 4.1 Numerical information field theory {#4-dot-1-numerical-information-field-theory}


### 4.2 Photon imaging {#4-dot-2-photon-imaging}


### 4.3 Available IFT algorithms {#4-dot-3-available-ift-algorithms}


### 4.4 Non-Gaussianity {#4-dot-4-non-gaussianity}


### 4.5 Information field dynamics {#4-dot-5-information-field-dynamics}


## 5. Outlook {#5-dot-outlook}
